USE `disasterManager`;

DELETE FROM  `disaster`;
DELETE FROM `disaster_subtype`;
DELETE FROM `disaster_index`;
DELETE FROM `disaster_type`;
DELETE FROM `source_subtype`;
DELETE FROM `source_type`;
DELETE FROM `carrier`;
# 导入信息
# 地址
SET GLOBAL local_infile=1;

LOAD DATA LOCAL INFILE 'c:/Users/86136/Desktop/项目管理/db/addr.csv' # csv文件的绝对路径
INTO TABLE addr FIELDS TERMINATED BY ','; 

# 来源 大类
INSERT INTO `source_type` VALUES
('1','为业务报送数据'),
('2','泛在感知数据'),
('3','其他数据');

# 来源 子类
INSERT INTO `source_subtype` VALUES
('1','00','前方地震应急指挥部'), 
('1','01','后方地震应急指挥部'),
('1','20','应急指挥技术系统'),
('1','21','社会服务工程应急救援系统'),
('1','40','危险区预评估工作组'),
('1','41','地震应急指挥技术协调组'), 
('1','42','震后政府信息支持工作项目组'), 
('1','80','灾情快速上报接收处理系统'),
('1','81','地方地震局应急信息服务相关技术系统'),
('1','99','其他'), 
('2','00','互联网感知'), 
('2','01','通信网感知'), 
('2','02','舆情网感知'), 
('2','03','电力系统感知'), 
('2','04','交通系统感知'),
('2','05','其他');

# 载体
INSERT INTO `carrier` VALUES
('0','文字'),
('1','图像'),
('2','音频'),
('3','视频'),
('4','其他'); 

# 灾情 大类
INSERT INTO `disaster_type` VALUES
('1','地震事件信息'),
('2','人员伤亡及失踪信息'),
('3','房屋破坏信息'),
('4','生命线工程灾情信息'),
('5','次生灾害信息'); 
  
# 灾情 子类
INSERT INTO `disaster_subtype` VALUES
('1','01','震情信息'),
('2','01','死亡'),
('2','02','受伤'),
('2','03','失踪'), 
('3','01','土木'),
('3','02','砖木'),
('3','03','砖混'),
('3','04','框架'),
('3','05','其他'),
('4','01','交通'),
('4','02','供水'),
('4','03','输油'),
('4','04','燃气'),
('4','05','电力'),
('4','06','通信'),
('4','07','水利'),
('5','01','崩塌'),
('5','02','滑坡'),
('5','03','泥石流'),
('5','04','岩溶塌陷'),
('5','05','地裂缝'),
('5','06','地面沉降'),
('5','07','其他');
 
# 灾情 指标
INSERT INTO `disaster_index` VALUES
('1','001','地理位置'),
('1','002','时间'),
('1','003','震级'),
('1','004','震源深度'),
('1','005','烈度'),
('2','001','受灾人数'),
('2','002','受灾程度'), 
('3','001','一般损坏面积'),
('3','002','严重损坏面积'),
('3','003','受灾程度'),
('4','001','受灾设施数'),
('4','002','受灾范围'),
('4','003','受灾程度'),
('5','001','灾害损失'),
('5','002','灾害范围'),
('5','003','受灾程度'); 